connect/soap-httpclient/src/main/resources/loginRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sf="urn:enterprise.soap.sforce.com">
   <soapenv:Header>
      <sf:LoginScopeHeader>
         
      </sf:LoginScopeHeader>
   </soapenv:Header>
   <soapenv:Body>
      <sf:login>
         <sf:username>daniel.meyer@camunda.com</sf:username>
         <sf:password>cam12345678!Ap1IY7Efm5aM8kVnk29N3zqp</sf:password>
      </sf:login>
   </soapenv:Body>
</soapenv:Envelope>